In [2]:
import pandas as pd
from math import sqrt

In [3]:
oyuncular = {"boy":[175,177,178,181,182,183,184,188,190], "deneyim":[4,6,3,2,6,3,7,2,6], "maas":[12,18,15,16,24,20,28,34,32]}

In [4]:
df = pd.DataFrame(oyuncular)

In [5]:
df

   boy  deneyim  maas
0  175        4    12
1  177        6    18
2  178        3    15
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28
7  188        2    34
8  190        6    32

In [6]:
df.maas.mean()

22.11111111111111

In [7]:
df.maas-df.maas.mean()

0   -10.111111
1    -4.111111
2    -7.111111
3    -6.111111
4     1.888889
5    -2.111111
6     5.888889
7    11.888889
8     9.888889
Name: maas, dtype: float64

# Mean Model

In [9]:
(df.maas-df.maas.mean()).pow(2).sum()

488.88888888888886

# İlk Bölme

In [10]:
filt = (df.boy <=180)

In [11]:
df1 = df[filt]

In [17]:
df2 = df[~filt]

In [18]:
df1

   boy  deneyim  maas
0  175        4    12
1  177        6    18
2  178        3    15

In [13]:
df1.maas.mean()

15.0

In [21]:
df2.maas.mean()

25.666666666666668

# İlk Bölme: Error

In [23]:
(df1.maas-df1.maas.mean()).pow(2).sum() + (df2.maas-df2.maas.mean()).pow(2).sum()

261.3333333333333

# İkinci Bölme

In [26]:
filt2 = (df2.boy <= 185)

In [27]:
df3 = df2[filt2]

In [28]:
df4 = df2[filt2]

In [29]:
df3.maas.mean()

22.0

In [30]:
df4

   boy  deneyim  maas
3  181        2    16
4  182        6    24
5  183        3    20
6  184        7    28

In [31]:
df4.maas.mean()

22.0

# İkinci Bölme: Error

In [32]:
(df1.maas-df1.maas.mean()).pow(2).sum() + (df3.maas-df3.maas.mean()).pow(2).sum() + (df4.maas-df4.maas.mean()).pow(2).sum()

178.0

# Üçüncü Bölme

In [33]:
filt3 = (df3.deneyim <=5)

In [34]:
df5 = df3[filt3]

In [35]:
df6 = df3[~filt3]

In [36]:
df5

   boy  deneyim  maas
3  181        2    16
5  183        3    20

In [37]:
df5.maas.mean()

18.0

In [38]:
df6

   boy  deneyim  maas
4  182        6    24
6  184        7    28

In [39]:
df6.maas.mean()

26.0

# Üçüncü Bölme :Error

In [ ]:
(df1.maas-df1.maas.mean()).pow(2).sum() + (df4.maas-df4.maas.mean()).pow(2).sum() + (df5.maas-df5.maas.mean()).pow(2).sum() + (df6.maas-df6.maas.mean()).pow(2).sum()